<?php

namespace Database\Seeders;
use App\Models\About;
use Illuminate\Database\Seeder;

class AboutSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
     About::create([
        'title' => 'Introduction',
        'image' => '',
        'content' => 'नेपालमा युवा विकासका लागि वि.सं. २०६६ सालमा पहिलो पटक र वि.सं. २०७२ मा परिमार्जित राष्ट्रिय युवा नीति २०७२ जारी गरियो । त्यसलाई प्रभावकारी रुपमा लागु गर्ने उद्देश्यले वि.सं. २०७२ सालमा युथ भिजन २०२५ तथा दशवर्षे रणनीतिक योजना जारी गरियो । यो दस्तावेज मिति २०७२/०६/१९ गते नेपाल सरकार मन्त्रीपरिषदबाट स्वीकृत भएको थियो । यसरी नेपालमा पहिलो पटक युवा विकासका लागि सरकारी स्तरबाट तयार भएको ठोश कार्ययोजना सहितको  दस्तावेजको रुपमा युथभिजन रहेको छ । यसको निर्माण गर्दा सरोकारवालाहरुसंग व्यापक छलफल, अन्तरक्रिया भएको र अत्यन्त सहभागितामूलक ढंगले निर्माण भएको थियो  । 

        यसरी राष्ट्रिय युवा नीति २०७२ र युथभिजन २०२५ तथा दशवर्षे रणनीतिक योजनामा परिलक्षित गरिएका युवालक्षित योजना र कार्यक्रमहरुलाई समस्त नेपाली युवाको विकास र परिचालनका लागि केन्द्रीय सरकारी निकायको रुपमा राष्ट्रिय युवा परिषद् ऐन २०७२ बमोजिम नेपाल सरकारले राष्ट्रिय युवा परिषद स्थापना गरेको हो । यस परिषदले नेपाल सरकारले स्वीकृत गरेका युवालक्षित कार्यक्रमको संघीय तह¸ प्रदेश तह र स्थानीय तहमा कार्यान्वयन तथा सोको लागि सहजीरकण गर्नुका साथै अन्य सरकारी तथा गैरसरकारी निकायहरुबाट सञ्चालित युवालक्षित कार्यक्रमहरुको समन्वय¸ सहकार्य र सहजीरकण गर्ने काम समेत गर्दछ ।
        
        हाल यसको केन्द्रीय कार्यालय सानोठिमी भक्तपुरमा रहेको छ । यसका शाखाहरु सबै जिल्लाहरुमा जिल्ला युवा समितिका कार्यालयहरु रहेका छन् । केही वर्षदेखि नेपाल संघीय ढाँचामा गइसकेपछि यसका संगठनात्मक ढाँचा र स्वरुपहरु परिवर्तन हुने क्रममा रहेका छन् । आगामी दिनमा केन्द्रमा राष्ट्रिय युवा परिषद¸ प्रदेश स्तरमा प्रदेश युवा परिषद् ¸ जिल्लामा जिल्ला युवा समन्वय इकाइ तथा सबै स्थानीय तहमा स्थानीय युवा परिषदको रुपमा विकास गरिने र प्रत्येक वडा तहमा युवाक्लबहरुको गठन गरी युवाका गतिविधिहरु सञ्चालन गर्ने यसका अंग तथा इकाइहरुलाई स्थानीय तहको वडा तथा गाउँ तहसम्म विस्तार गरिनेछ ।',
     ]);
    }
}
